Documents/МаркировкаТоваровИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>МаркировкаТоваровИСМП</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/МаркировкаТоваровИСМП/Ext/ObjectModule.bsl
&После("ПередЗаписью")
Процедура ИК_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ Отказ
		И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		ВсеТоварыОпубликованы = ПроверитьПубликациюТоваров();
		Если НЕ ВсеТоварыОпубликованы Тогда
			Отказ = Истина;
			Сообщить("Не все товары по документу опубликованы");	
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

Функция ПроверитьПубликациюТоваров()
	
	ТЗТовары = Товары.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаркировкаТоваровИСМПТовары.Номенклатура КАК Номенклатура,
		|	МаркировкаТоваровИСМПТовары.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&Товары КАК МаркировкаТоваровИСМПТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	ВТ_Товары.Характеристика КАК Характеристика
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ПО ВТ_Товары.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
		|			И ВТ_Товары.Характеристика = ШтрихкодыНоменклатуры.Характеристика
		|ГДЕ
		|	ШтрихкодыНоменклатуры.гф_СостояниеВыгрузкиНоменклатуры ЕСТЬ NULL
		|		ИЛИ ШтрихкодыНоменклатуры.гф_СостояниеВыгрузкиНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.гф_СтатусыGTIN_В_НК.Опубликован)";
	
	Запрос.УстановитьПараметр("Товары", ТЗТовары);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции
